Revit 2027 API
ViewScheduleExportOptions.FieldDelimiter Property
 How to delimit fields. Default is Tab.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string FieldDelimiter { get; set; }
Public Property FieldDelimiter As String
	Get
	Set
public:
property String^ FieldDelimiter {
	String^ get ();
	void set (String^ value);
}
member FieldDelimiter : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ViewScheduleExportOptions Class
Autodesk.Revit.DB Namespace